{
  "backend/main.mo": "Empty Motoko actor with no implemented methods.",
  "feature_evidence.json": "Contains feature evidence metadata linking features to affected frontend files and components.",
  "frontend-file-summaries.txt": "Text file mapping frontend file paths to short functional summaries.",
  "frontend/index.css": "Tailwind base and theme variable definitions for light and dark modes with Valentine color tokens.",
  "frontend/index.html": "Basic HTML shell loading the React app via main.tsx.",
  "frontend/src/App.tsx": "Controls the three-step flow (landing, gifts, final) using React state inside a layout wrapper.",
  "frontend/src/components/BalloonRiseAnimation.tsx": "Displays timed rising balloon animations and calls onComplete after 4 seconds.",
  "frontend/src/components/GiftCard.tsx": "Gift card component with lock logic, open animation, and expandable content.",
  "frontend/src/components/LayoutShell.tsx": "Provides gradient background layout and a footer with attribution link.",
  "frontend/src/components/SafeGeneratedImage.tsx": "Image loader that falls back to a styled error box when the file is missing.",
  "frontend/src/config/valentineContent.ts": "Central config defining name, love note text, and filenames for photos.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor via react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login state and creating AuthClient instances.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder since no backend queries are used.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom OKLCH color variables for light/dark mode, Valentine pink utilities, and several animations.",
  "frontend/src/main.tsx": "Initializes React app with React Query and InternetIdentityProvider, importing global styles.",
  "frontend/src/screens/FinalCelebrationScreen.tsx": "Renders final celebration view with a generated couple photo and animated heart decorations.",
  "frontend/src/screens/GiftsScreen.tsx": "Implements the three‑gift flow with locking logic, dialogs, balloon animation for gift 3, and photo reveals.",
  "frontend/src/screens/LandingScreen.tsx": "Displays the Valentine question with Yes/No buttons, including an evasive No button using random positioning.",
  "frontend/src/utils/randomPosition.ts": "Provides a helper to compute a random on‑screen position for UI elements.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH color tokens, animations, typography, and container settings.",
  "project_state.json": "Describes project metadata, feature list, and overall Valentine app structure and requirements."
}