{
  "backend/main.mo": "Empty Motoko actor with no backend logic.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "Contains prewritten summaries for all frontend source files.",
  "frontend/DEPLOYMENT_RETRY_RUNBOOK.md": "Runbook outlining steps to retry deployment and verify required assets.",
  "frontend/index.css": "Tailwind base styles defining color tokens and global theming for light and dark modes.",
  "frontend/index.html": "Basic HTML entry page loading the main React script.",
  "frontend/scripts/.gitkeep": "Placeholder file to keep the scripts directory in version control.",
  "frontend/scripts/retry-deploy-and-capture-logs.sh": "Deployment script that logs environment details, checks required images, and runs dfx and frontend build steps.",
  "frontend/src/App.tsx": "Top‑level React component managing the landing, gifts, and final screens via local state.",
  "frontend/src/components/BalloonRiseAnimation.tsx": "Shows rising balloon animations for a timed sequence before continuing workflow.",
  "frontend/src/components/GiftCard.tsx": "Interactive gift card component with locked, unlocked, and opened states and open animations.",
  "frontend/src/components/LayoutShell.tsx": "Layout wrapper providing gradient background and a footer with attribution.",
  "frontend/src/components/SafeGeneratedImage.tsx": "Image loader that shows loading and fallback UI when generated assets fail to load.",
  "frontend/src/config/valentineContent.ts": "Holds static Valentine content including messages and filenames for required images.",
  "frontend/src/hooks/useActor.ts": "React hook creating and refreshing an authenticated or anonymous backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing login flow, stored identities, and auth client creation.",
  "frontend/src/hooks/useQueries.ts": "Empty module placeholder exporting nothing as no backend queries are needed.",
  "frontend/src/index.css": "Tailwind base styles plus custom color variables, Valentine-themed utilities, and animation keyframes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/screens/FinalCelebrationScreen.tsx": "Displays the final celebration image and animated hearts using the provided final couple photo.",
  "frontend/src/screens/GiftsScreen.tsx": "Implements a multi‑step gift‑opening screen with dialogs, animations, photo reveals, and progression logic.",
  "frontend/src/screens/LandingScreen.tsx": "Renders the Valentine question screen with a moving 'No' button and calls a handler when 'Yes' is clicked.",
  "frontend/src/utils/randomPosition.ts": "Generates a random top/left position for an element within container bounds.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, themes, plugins, and extended utilities for the app’s styling.",
  "project_state.json": "Describes the Valentine website’s current state, features, architectural notes, and known issues. Highlights photo-asset problems in Gift 2 and marks the file as a fix request."
}