{
  "backend/main.mo": "Minimal Motoko canister with an empty actor.",
  "feature_evidence.json": "JSON report describing a feature deployment check involving frontend assets and related components.",
  "frontend-file-summaries.txt": "Mapping of frontend file paths to short descriptions of their purpose in the Valentine app.",
  "frontend/DEPLOYMENT_RETRY_RUNBOOK.md": "Runbook detailing steps to verify assets, retry deployment, and perform post-deployment validation.",
  "frontend/index.css": "Tailwind base styles and OKLCH color variables defining theme, backgrounds, and component styling.",
  "frontend/index.html": "Basic HTML entry file mounting the React app and loading main.tsx.",
  "frontend/scripts/.gitkeep": "Placeholder file to keep the scripts directory tracked in git.",
  "frontend/scripts/retry-deploy-and-capture-logs.sh": "Deployment script that logs environment info, verifies Gift 2 photos, and runs build/deploy steps with logging.",
  "frontend/src/App.tsx": "Root React component managing navigation between landing, gifts, and final steps.",
  "frontend/src/components/BalloonRiseAnimation.tsx": "Animated balloon-rise effect that runs for 4 seconds then triggers a completion callback.",
  "frontend/src/components/GiftCard.tsx": "Gift card component with lock, open, and animation behaviors and a reveal area for content.",
  "frontend/src/components/LayoutShell.tsx": "Layout wrapper providing themed background and footer with caffeine.ai attribution.",
  "frontend/src/components/SafeGeneratedImage.tsx": "Image loader that shows a styled fallback when a generated asset is missing or fails to load.",
  "frontend/src/config/valentineContent.ts": "Static content config defining names, love note text, and lists of image filenames.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor using react-query.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity auth state, including creating AuthClient, loading stored identities, login handling, and exposing identity/status flags.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file exporting nothing, as the app uses no backend queries.",
  "frontend/src/index.css": "Defines Tailwind base layers, custom CSS variables, Valentine‑themed colors, dark mode styles, utility classes, and animation keyframes.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and the InternetIdentityProvider before rendering App.",
  "frontend/src/screens/FinalCelebrationScreen.tsx": "Displays the final celebration screen with a generated couple photo, large Valentine text, and animated heart icons.",
  "frontend/src/screens/GiftsScreen.tsx": "Implements a multi‑step interactive gifts screen with unlockable gifts, balloon animation, photo reveals, and a help dialog for customizing images.",
  "frontend/src/screens/LandingScreen.tsx": "Renders the initial Valentine question screen with a moving 'No' button and a static 'Yes' button triggering progression.",
  "frontend/src/utils/randomPosition.ts": "Generates a random top/left position for an element within container bounds.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, container settings, and Valentine‑themed design tokens.",
  "project_state.json": "Describes the current Valentine website project state, including features, architectural notes, and issues with Gift 2 photo assets not displaying. Marks the file as a fix request and outlines required static asset updates for user-provided photos."
}