{
  "kind": "build_request",
  "title": "Fix Gift 2 photos not found: ensure user images are present and served",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Ensure the three user photo files for Gift 2 exist in the deployed frontend static assets folder at exactly these paths and filenames (case-sensitive):\n- frontend/public/assets/generated/IMG_0131-1.jpeg\n- frontend/public/assets/generated/IMG_4617-1.jpeg\n- frontend/public/assets/generated/IMG_0156-1.jpeg",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "Again photos not found add my photos in gift 2 frontend velantine content and show them in website"
        ]
      },
      "acceptanceCriteria": [
        "All three files exist in the repository at frontend/public/assets/generated/ with the exact filenames listed (including case and extension).",
        "After deployment, each image is reachable by direct URL:\n- /assets/generated/IMG_0131-1.jpeg\n- /assets/generated/IMG_4617-1.jpeg\n- /assets/generated/IMG_0156-1.jpeg"
      ]
    },
    {
      "id": "REQ-23",
      "text": "Verify and (if needed) correct Gift 2 configuration so the Gift 2 gallery is driven only by HER_PHOTOS and uses exactly these filenames in this order: ['IMG_0131-1.jpeg','IMG_4617-1.jpeg','IMG_0156-1.jpeg'] (no placeholder filenames).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "add my photos in gift 2 frontend velantine content and show them in website"
        ]
      },
      "acceptanceCriteria": [
        "frontend/src/config/valentineContent.ts exports HER_PHOTOS with exactly the three filenames in the required order and contains no placeholder photo entries for Gift 2.",
        "Gift 2 (“Beautiful You”) renders exactly 3 images sourced from /assets/generated/<filename> using the HER_PHOTOS array."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Rebuild and redeploy the frontend and validate on the live site that Gift 2 shows the three user photos (not the “Image not found” fallback).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-3"
        ],
        "quotes": [
          "show them in website"
        ]
      },
      "acceptanceCriteria": [
        "In the live deployment, opening Gift 2 (“Beautiful You”) shows the three user photos and does not show any “Image not found” fallback cards.",
        "If any of the three images still fail to load, capture and provide the failing asset URL(s) and the browser network error/status for each."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or any files under frontend/src/components/ui.",
    "Keep the backend as a single Motoko actor in backend/main.mo; no backend changes are required for this fix."
  ],
  "nonGoals": [
    "Do not change Gift 1, Gift 3, or the Final Celebration content/behavior beyond what is necessary to fix Gift 2 photo loading.",
    "Do not add new authentication, databases, or external services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}